src/ChartsOfCalculationTypes/ОсновныеНачисленияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>ОсновныеНачисленияОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<BaseCalculationTypes>
				<xr:Item>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</xr:Item>
				<xr:Item>ChartOfCalculationTypes.ДополнительныеНачисленияОрганизаций</xr:Item>
			</BaseCalculationTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаОплатыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетОтработанногоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетНормыВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияОтраженияВУчете</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтратегииОтраженияВРеглУчетеНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтнесениеРасходовКДеятельностиЕНВД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтнесениеРасходовКДеятельностиЕНВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПоСт255НК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийОплатыТрудаПоСт255НК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаЕСН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыЕСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходСтрах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходЕдиныйПлатеж</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКатегорияРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьКатегорииРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбозначениеВТабелеУчетаРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоэффициентыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДоходомВНатуральнойФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетВводаТарифногоРазряда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходыОтчислений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыЕСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтнесенияЗП</Name>
					<Comment>Тип отнесения ЗП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОтнесенияЗП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольнаяФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЕжегодногоОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЕжегодныхОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНачисленияКонтракта</Name>
					<Comment>Способ начисления контракта</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьВСпискеВыбора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНеИспользуетсяВПУ6</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчисленияНаППС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособИспользованияВидаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСтавка1Разряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВПрочиеНачисления</Name>
					<Comment>Входит в прочие начисления</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повышения</Name>
					<Comment>Повышения тарифного коэффициента</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Надбавки</Name>
					<Comment>Надбавки к окладу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доплаты</Name>
					<Comment>Доплаты к окладу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагРасчетОтСреднихЧасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяУправленческогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьяУправленческогоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьПоказательРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляРублейЧ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопДоход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаОтчета6тОСоставеЗарплаты</Name>
					<Comment>Свэй,  Задача  СВФР-002328</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчета6тОСоставеЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьОплачиваемоеВремяВДокументах</Name>
					<Comment>//+ СВЭЙ КДЯ 03.12.19 СВФР-005157</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВыслугиОтБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьвФЗП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзПрибыли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПоПериодуРегистрацииДля12т</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПоФОТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРаспределятьПоНаряду</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подоходный2023</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодДоходаПодоходный2023</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободныйДеньФСЗН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеактуальноеНачисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочаяПричинаМинимальнойЗП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныМинимальнойЗаработнойПлаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ППСНаРуки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиСхемМотивации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапрашиватьПриКадровыхПеремещениях</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыВРДляОтражения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

src/Enums/ВидыВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеВПределахНормы</Name>
					<Comment>Начисление за работу полную рабочую смену в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтработанноеСверхНормы</Name>
					<Comment>Начисление за работу сверх нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦелодневноеНеотработанное</Name>
					<Comment>Неотработанные полные смены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеНеотработанное</Name>
					<Comment>Неотработанные неполные смены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноОплачиваемоеВПределахНормы</Name>
					<Comment>Дополнительное начисление в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧасовоеОтработанноеВПределахНормы</Name>
					<Comment>Начисление за работу неполную смену в пределах нормы времени</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтратегииОтраженияВРеглУчетеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтратегииОтраженияВРеглУчетеНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоВидуРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоНаНачалоСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакБазовыеНачисления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ChartsOfCalculationTypes/ОсновныеНачисленияОрганизаций/Ext/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура выполняет обновление реквизитов "ЗачетОтработанногоВремени" и
// "ЗачетНормыВремени" в зависимости от значения ОбозначениеВТабелеУчетаРабочегоВремени.ВидВремени
//
// Параметры:
//  Нет.
//
Процедура ОбновитьПризнакиУчетаВремени() Экспорт
	//Аверсон-софт, Островская Татьяна 21.03.2012 №15092
	ЭтоРасчетПроцентом = СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.Процентом
	или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ИндексацияЗП //О.Т. Аверсон 04.11.2016 № 1501
	или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроцентомОтТарифаИБазы
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ОтСтажаПроцентом
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.СевернаяНадбавка;
	
	Если Не ЭтоРасчетПроцентом Тогда
		Для Каждого Показатель Из Показатели Цикл
			
			Если Показатель = Справочники.ПоказателиСхемМотивации.РасчетнаяБаза Тогда
				ЭтоРасчетПроцентом = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;							
	
	
	Если ЭтоРасчетПроцентом Тогда
		Если ОбозначениеВТабелеУчетаРабочегоВремени.Пустая() Тогда
			ОбозначениеВТабелеУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.Работа
		КонецЕсли;
		Если ВидВремени.Пустая() Тогда
			ВидВремени = Перечисления.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы
		КонецЕсли;
	КонецЕсли;
	
	Если ВидВремени = Перечисления.ВидыВремени.ОтработанноеВПределахНормы Тогда
		ЗачетОтработанногоВремени 	= Истина;
		ЗачетНормыВремени 			= Истина;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ОтработанноеСверхНормы Тогда
		ЗачетОтработанногоВремени 	= Истина;
		ЗачетНормыВремени 			= Ложь;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЦелодневноеНеотработанное Тогда
		ЗачетОтработанногоВремени 	= Ложь;
		ЗачетНормыВремени 			= Истина;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЧасовоеНеотработанное Тогда
		ЗачетОтработанногоВремени 	= Ложь;
		ЗачетНормыВремени 			= Истина;
	ИначеЕсли ВидВремени = Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы Тогда
		ЗачетОтработанногоВремени 	= Истина;
		ЗачетНормыВремени			= Истина;
	Иначе
		ЗачетОтработанногоВремени 	= Ложь;
		ЗачетНормыВремени 			= Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура УточнитьСтратегиюОтраженияВУчете() Экспорт
	
	ЭтоПособиеЗаСчетФСС = СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПоСреднемуЗаработкуФСС И Ссылка.КодДоходаЕСН <> Справочники.ДоходыЕСН.БольничныйПроизводстТравма
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеМатериОдиночкеДо1_5лет
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеМатериОдиночкеДо3Лет
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаВИЧ
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо18ЛетНадб40
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаДо3Лет
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаИнвалида
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаСНадбавкой40До3Лет
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНаРебенкаСтарше3Лет
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНеРабМатериНадб40До3Лет
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНеРабМатериОдиночкеДо1_5Лет
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНеРабМатериОдиночкеДо3Лет
	Или СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПособиеНеРаботающейМатериДо3Лет;
	
	Если Не ЭтоПособиеЗаСчетФСС Тогда
		СтратегияОтраженияВУчете = ?(СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.РаспределятьПоБазовымНачислениям,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления,?(СпособОтраженияВБухучете.Пустая(), Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоВидуРасчета));	
	КонецЕсли;							
	
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)
	Если ОбъектКопирования.Предопределенный Тогда
		ТЧ = ВытесняющиеВидыРасчета.Выгрузить();
		ТЧ.ЗаполнитьЗначения(Ложь,"Предопределенный");
		ВытесняющиеВидыРасчета.Загрузить(ТЧ);
	КонецЕсли;
	КодДоходаНДФЛ	= ОбъектКопирования.КодДоходаНДФЛ;
	КодДоходаЕСН	= ОбъектКопирования.КодДоходаЕСН;
	//КодДоходаФСС_НС	= ОбъектКопирования.КодДоходаФСС_НС;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если НЕ ОбменДанными.Загрузка Тогда
		//Если ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = Перечисления.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоТрудовомуЗаконодательству Тогда
		//	ПериодРасчетаСреднегоЗаработка = 0
		//КонецЕсли;
		// Обновим реквизиты "ЗачетОтработанногоВремени" и "ЗачетНормыВремени"
		ОбновитьПризнакиУчетаВремени();	
		УточнитьСтратегиюОтраженияВУчете();
	КонецЕсли;
	
	Если ПроизвольнаяФормулаРасчета И СпособРасчета <> Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула Тогда
		СпособРасчета = Перечисления.СпособыРасчетаОплатыТруда.ПроизвольнаяФормула;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда // проверки не выполняем
		Возврат
	КонецЕсли;
	
	Если ВидВремени = Перечисления.ВидыВремени.ОтработанноеСверхНормы Тогда
		Если (ОбозначениеВТабелеУчетаРабочегоВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные
			И ОбозначениеВТабелеУчетаРабочегоВремени <> Справочники.КлассификаторИспользованияРабочегоВремени.Праздники) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Указан неверный вид времени по классификатору использования рабочего времени!", Отказ);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ВидВремени) и ВидВремени <> Перечисления.ВидыВремени.ДополнительноОплачиваемоеВПределахНормы Тогда
		Если ОбозначениеВТабелеУчетаРабочегоВремени.Пустая() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Для начисления, по которому регистрируется отработанное (или неотработанное время), необходимо задать конкретный вид времени по классификатору использования рабочего времени!", Отказ);
		ИначеЕсли (ВидВремени = Перечисления.ВидыВремени.ЦелодневноеНеотработанное 
			Или ВидВремени = Перечисления.ВидыВремени.ЧасовоеНеотработанное) и ОбозначениеВТабелеУчетаРабочегоВремени.РабочееВремя Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Указан неверный вид времени по классификатору использования рабочего времени!", Отказ);
		ИначеЕсли (ВидВремени = Перечисления.ВидыВремени.ОтработанноеВПределахНормы 
			Или ВидВремени = Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы) и Не ОбозначениеВТабелеУчетаРабочегоВремени.РабочееВремя Тогда 
			ОбщегоНазначения.СообщитьОбОшибке("Указан неверный вид времени по классификатору использования рабочего времени!", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	// Описание текста запроса:
	// Первая часть запроса - поиск видов расчета, которые вытесняЮт текущий, являющийся почасовым отклонением: 
	//		Выбираются виды расчета, которые вытесняЕт текущий, проверяется отсутствие таких видов
	//
	// Вторая часть запроса - поиск видов расчета, которые вытесняЕт текущий, являющийся почасовым отклонением: 
	//		Выбираются виды расчета, которые вытесняЕт текущий, проверяется отсутствие таких видов
	//
	// Третья часть запроса - поиск видов расчета, являющихся почасовыми отклонениями, которые вытесняЮт текущий: 
	//		Для вида расчета, не являющегося почасовым отклонением, поиск вытесняющий его видов - почасовых отклонений
	// 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("парамСсылка", Ссылка);
	НецелосменноеВремя = Новый Массив;
	НецелосменноеВремя.Добавить(Перечисления.ВидыВремени.ЧасовоеНеотработанное);
	НецелосменноеВремя.Добавить(Перечисления.ВидыВремени.ЧасовоеОтработанноеВПределахНормы);
	Запрос.УстановитьПараметр("НецелосменноеВремя", НецелосменноеВремя);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	""Для нецелодевных начислений нельзя назначать вытесняющие виды расчета"" КАК ОписаниеКонфликта
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(*) КАК КоличествоВР
	|	ИЗ
	|		ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ВытесняющиеВР
	|	ГДЕ
	|		ВытесняющиеВР.Ссылка = &парамСсылка
	|		И ВытесняющиеВР.Ссылка.ВидВремени В(&НецелосменноеВремя)) КАК ДанныеПоВытесняющимВР
	|ГДЕ
	|	ДанныеПоВытесняющимВР.КоличествоВР > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Недопустимо назначение нецелодевного начисления '"" + ОсновныеНачисления.Ссылка.Наименование + ""' как вытесняющего для '"" + ВытесняемыеНачисления.Ссылка.Наименование + ""'""
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ВытесняемыеНачисления
	|		ПО ОсновныеНачисления.Ссылка = ВытесняемыеНачисления.ВидРасчета
	|ГДЕ
	|	ОсновныеНачисления.Ссылка = &парамСсылка
	|	И ОсновныеНачисления.ВидВремени В(&НецелосменноеВремя)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Недопустимо назначение нецелодевного начисления '"" + ВытесняющиеВР.ВидРасчета.Наименование + ""' в качестве вытесняющего вида расчета""
	|ИЗ
	|	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ВытесняющиеВР
	|ГДЕ
	|	ВытесняющиеВР.Ссылка = &парамСсылка
	|	И ВытесняющиеВР.ВидРасчета.ВидВремени В(&НецелосменноеВремя)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ОписаниеКонфликта) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(Выборка.ОписаниеКонфликта, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
